Table: Accounts

+-------------+------+
| Column Name | Type |
+-------------+------+
| account_id  | int  |
| income      | int  |
+-------------+------+
account_id is the primary key (column with unique values) for this table.
Each row contains information about the monthly income for one bank account.
 

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Accounts table:
+------------+--------+
| account_id | income |
+------------+--------+
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |
+------------+--------+
Output: 
+----------------+----------------+
| category       | accounts_count |
+----------------+----------------+
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |
+----------------+----------------+
Explanation: 
Low Salary: Account 2.
Average Salary: No accounts.
High Salary: Accounts 3, 6, and 8.

In [1]:
import pandas as pd

def income_category(income:int) -> str:
    if income < 20000:
        return "Low Salary"
    elif income <= 50000:
        return "Average Salary"
    else:
        return "High Salary"

def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    cat_data_type = pd.api.types.CategoricalDtype(categories = ['Low Salary', 'Average Salary', 'High Salary'], ordered = True)
    accounts['income'] =  accounts.apply(lambda row: income_category(row['income']), axis = 1).astype(dtype = cat_data_type)
    return accounts.groupby(by = 'income').agg('count').reset_index().rename(columns = {'income':'category','account_id':'accounts_count'})

In [2]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [3]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [4]:
count_salary_categories(accounts)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

### Alternative / Faster Approach

In [5]:
import pandas as pd

def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    return pd.DataFrame(data = {'category':['Low Salary','Average Salary','High Salary'],
                     'accounts_count':[accounts.loc[accounts.income < 20000].shape[0],
                                       accounts.loc[(accounts.income >= 20000) & (accounts.income <= 50000)].shape[0],
                                       accounts.loc[accounts.income > 50000].shape[0]]})

In [6]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [7]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [8]:
pd.DataFrame(data = {'category':['Low Salary','Average Salary','High Salary'],
                     'accounts_count':[accounts.loc[accounts.income < 20000].shape[0],
                                       accounts.loc[(accounts.income >= 20000) & (accounts.income <= 50000)].shape[0],
                                       accounts.loc[accounts.income > 50000].shape[0]]})

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

In [9]:
count_salary_categories(accounts)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3